---
kind: method
id: M:Autodesk.Revit.DB.UpdaterInfo.Dispose
source: html/8479e633-a836-be39-82c2-3ed033c80ef8.htm
---
# Autodesk.Revit.DB.UpdaterInfo.Dispose Method

Releases all resources used by the UpdaterInfo

## Syntax (C#)
```csharp
public void Dispose()
```